In [1]:
from pandas import Series, DataFrame

import pandas as pd
import numpy as np

In [9]:
#to reindex a column as index, should be same as pivot table may be 

df_1 = DataFrame({'jobId': ['a1','a2','b1','b6','c1'],
                   'salary':[110,100,90,79,46],
                    'years':[5,10,4,3,7]})

In [10]:
df_1

  jobId  salary  years
0    a1     110      5
1    a2     100     10
2    b1      90      4
3    b6      79      3
4    c1      46      7

In [11]:
df_1.set_index(keys='jobId',inplace=True)

In [12]:
df_1

       salary  years
jobId
a1        110      5
a2        100     10
b1         90      4
b6         79      3
c1         46      7

In [13]:
df_1.to_dict()

{'salary': {'a1': 110, 'a2': 100, 'b1': 90, 'b6': 79, 'c1': 46},
 'years': {'a1': 5, 'a2': 10, 'b1': 4, 'b6': 3, 'c1': 7}}

In [14]:
df_1.values

array([[110,   5],
       [100,  10],
       [ 90,   4],
       [ 79,   3],
       [ 46,   7]])

In [15]:
df_1.index

Index(['a1', 'a2', 'b1', 'b6', 'c1'], dtype='object', name='jobId')

In [17]:
df_1*2

       salary  years
jobId
a1        220     10
a2        200     20
b1        180      8
b6        158      6
c1         92     14

In [7]:
obj = Series([3,5,6,7])

In [8]:
obj

0    3
1    5
2    6
3    7
dtype: int64

In [9]:
obj.values

array([3, 5, 6, 7])

In [11]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
obj2 = Series([3,4,-9,10],index = ['d','a','c','b'])

In [14]:
obj2.index

Index(['d', 'a', 'c', 'b'], dtype='object')

In [15]:
obj2[['c','a']]

c   -9
a    4
dtype: int64

In [16]:
obj2 **2

d      9
a     16
c     81
b    100
dtype: int64

In [19]:
np.exp(obj2)

d       20.085537
a       54.598150
c        0.000123
b    22026.465795
dtype: float64

In [20]:
statedata = {'Ohio': 35000, 'Texas' : 71000, 'Oregon' : 16000, 'Utah': 5000}

In [23]:
obj3 = Series(statedata)

In [26]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [28]:
states = ['Califoria', 'Ohio', 'Texas', 'Oregon']

obj4 = Series(statedata, index = states)

In [29]:
obj4

Califoria        NaN
Ohio         35000.0
Texas        71000.0
Oregon       16000.0
dtype: float64

In [30]:
pd.isnull(obj4)

Califoria     True
Ohio         False
Texas        False
Oregon       False
dtype: bool

In [31]:
obj4.notnull()

Califoria    False
Ohio          True
Texas         True
Oregon        True
dtype: bool

In [32]:
obj3+obj4

Califoria         NaN
Ohio          70000.0
Oregon        32000.0
Texas        142000.0
Utah              NaN
dtype: float64

In [36]:
obj3.add(obj4,fill_value = 0)

Califoria         NaN
Ohio          70000.0
Oregon        32000.0
Texas        142000.0
Utah           5000.0
dtype: float64

In [38]:
obj4.index = ['Denver', 'Utah', 'WC','Nyc']

In [39]:
obj4

Denver        NaN
Utah      35000.0
WC        71000.0
Nyc       16000.0
dtype: float64

In [20]:
#now exploring dataframes

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada','Nevada'],
        'year': [2000,2001,2002,2001,2002],
        'pop': [1.5,1.7,3.6,2.4,2.9]}

In [21]:
dframe = DataFrame(data)

In [42]:
dframe

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [44]:
DataFrame(data, columns =['year','pop','state'])

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada

In [22]:
frame2 = DataFrame(data, columns = ['year','state','pop','debt'],index = [10,11,12,12,14])

frame2

    year   state  pop debt
10  2000    Ohio  1.5  NaN
11  2001    Ohio  1.7  NaN
12  2002    Ohio  3.6  NaN
12  2001  Nevada  2.4  NaN
14  2002  Nevada  2.9  NaN

In [34]:
frame2.loc[(frame2['state']=='Nevada') & (frame2['year']==2001)]

    year   state  pop debt
12  2001  Nevada  2.4  NaN

In [57]:
frame2.pop

<bound method NDFrame.pop of     year   state  pop debt
10  2000    Ohio  1.5  NaN
11  2001    Ohio  1.7  NaN
12  2002    Ohio  3.6  NaN
12  2001  Nevada  2.4  NaN
14  2002  Nevada  2.9  NaN>

In [ ]:
frame2.iloc, loc, get_loc

In [43]:
frame2[['pop','state']]
slicing using index also

    pop   state
10  1.5    Ohio
11  1.7    Ohio
12  3.6    Ohio
12  2.4  Nevada
14  2.9  Nevada

In [61]:
frame2.loc[10]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: 10, dtype: object

In [62]:
frame2['state']

10      Ohio
11      Ohio
12      Ohio
12    Nevada
14    Nevada
Name: state, dtype: object

In [67]:
frame2['membership'] = True

frame2['debt'] = [1.5, 6, 2.4, 4, 5.5]

frame2

    year   state  pop  debt  membership
10  2000    Ohio  1.5   1.5        True
11  2001    Ohio  1.7   6.0        True
12  2002    Ohio  3.6   2.4        True
12  2001  Nevada  2.4   4.0        True
14  2002  Nevada  2.9   5.5        True

In [49]:
frame2.pop

<bound method NDFrame.pop of     year   state  pop debt
10  2000    Ohio  1.5  NaN
11  2001    Ohio  1.7  NaN
12  2002    Ohio  3.6  NaN
12  2001  Nevada  2.4  NaN
14  2002  Nevada  2.9  NaN>

In [47]:
ts

<bound method NDFrame.pop of     year   state  pop debt
10  2000    Ohio  1.5  NaN
11  2001    Ohio  1.7  NaN
12  2002    Ohio  3.6  NaN
12  2001  Nevada  2.4  NaN
14  2002  Nevada  2.9  NaN>

In [80]:
frame2['debt'] = Series([4.5, 6], index = [12,15])

In [81]:
frame2

    year   state  pop  debt
10  2000    Ohio  1.5   NaN
11  2001    Ohio  1.7   NaN
12  2002    Ohio  3.6   4.5
12  2001  Nevada  2.4   4.5
14  2002  Nevada  2.9   NaN

In [82]:
del frame2['debt']

frame2

    year   state  pop
10  2000    Ohio  1.5
11  2001    Ohio  1.7
12  2002    Ohio  3.6
12  2001  Nevada  2.4
14  2002  Nevada  2.9

In [83]:
frame2.columns

Index(['year', 'state', 'pop'], dtype='object')

In [84]:
frame2.index

Int64Index([10, 11, 12, 12, 14], dtype='int64')

In [88]:
pop = {'Nevada' : {2001:2.4, 2002: 2.9},
       'Ohio' : {2000:1.5, 2001:1.7, 2002:3.6}}

frame3 = DataFrame(pop)

In [89]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [90]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [91]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [92]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [94]:
frame2.values

array([[2000, 'Ohio', 1.5],
       [2001, 'Ohio', 1.7],
       [2002, 'Ohio', 3.6],
       [2001, 'Nevada', 2.4],
       [2002, 'Nevada', 2.9]], dtype=object)

In [95]:
#Indexing and reindexing

obj = Series(range(3), index = ['a','b','c'])
index = obj.index

index

Index(['a', 'b', 'c'], dtype='object')

In [96]:
index[0] = 'z'

TypeError: Index does not support mutable operations

In [98]:
obj2 = Series (range(4), index = ['1','2','4','5'])
obj2.index

Index(['1', '2', '4', '5'], dtype='object')

In [99]:
index.append(obj2.index)

Index(['a', 'b', 'c', '1', '2', '4', '5'], dtype='object')

In [107]:
obj = Series([4.5, 7.6, -5.2, 3.5], index = ['d','b','a','c'])

obj

d    4.5
b    7.6
a   -5.2
c    3.5
dtype: float64

In [108]:
obj2 = obj.reindex(['a','b','c','e'])

obj2

a   -5.2
b    7.6
c    3.5
e    NaN
dtype: float64

In [109]:
obj2 = obj.reindex(['a','b','c','e'], fill_value = 0)
obj2

a   -5.2
b    7.6
c    3.5
e    0.0
dtype: float64

In [110]:
obj3 = Series(['blue','purple','yellow'], index = [0,2,4])

obj3.reindex(range(6), method = 'ffill')   ##doesnt change the actual object only the copy

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [113]:
frame = DataFrame((np.arange(9).reshape((3,3))), index = ['a','c','d'],columns = ['Ohio','Texas','California'])

In [114]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [115]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [119]:
frame2.reindex(columns = ['Texas','Utah','California'])

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [126]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [133]:
states = ['Texas','Utah','California']
frame.reindex(index = ['a','b','c','d'], columns = states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [134]:
#dropping / data munging

obj = Series(np.arange(5.), index = ['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [135]:
#original object doesnt change, drop creates new object
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [138]:
obj.drop(['a','d'])

b    1.0
c    2.0
e    4.0
dtype: float64

In [139]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [141]:
frame.drop('Ohio',axis = 1)

   Texas  California
a      1           2
c      4           5
d      7           8

In [142]:
frame.drop('c')

   Ohio  Texas  California
a     0      1           2
d     6      7           8

In [143]:
#slicing on series and dataframes
obj = Series(np.arange(4.), index = ['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [147]:
frame.loc['a',['Texas','Ohio']]

Texas    1
Ohio     0
Name: a, dtype: int64

In [148]:
#function application on frames
frame = DataFrame(np.random.randn(4,3), columns = list('bde'), index = ['Utah','Ohio', 'Texas','Oregon'])

In [149]:
frame

               b         d         e
Utah    0.666073  0.939555  0.439152
Ohio    0.242913  1.488893 -0.624797
Texas   0.277146 -1.396807 -0.311882
Oregon -1.056780 -1.482937  0.309785

In [152]:
f = lambda x: x.max() - x.min()

frame.apply(f, axis = 1)

Utah      0.500403
Ohio      2.113690
Texas     1.673952
Oregon    1.792721
dtype: float64

In [153]:
def f(x): return Series([x.min(),x.max()], index = ['min','max'])

frame.apply(f)

            b         d         e
min -1.056780 -1.482937 -0.624797
max  0.666073  1.488893  0.439152

In [154]:
frame.apply(f, axis = 1)

             min       max
Utah    0.439152  0.939555
Ohio   -0.624797  1.488893
Texas  -1.396807  0.277146
Oregon -1.482937  0.309785

In [155]:
format_f = lambda x :'%.2f' % x

frame.applymap(format)

                          b                    d                    e
Utah     0.6660731988767468   0.9395551293539289   0.4391522209683924
Ohio    0.24291296640941548   1.4888932901676528  -0.6247965256410429
Texas    0.2771457795280634   -1.396806556147626  -0.3118822410252793
Oregon  -1.0567804912210796  -1.4829365470206022   0.3097845682045474

In [157]:
frame['e'].map(format)

Utah       0.4391522209683924
Ohio      -0.6247965256410429
Texas     -0.3118822410252793
Oregon     0.3097845682045474
Name: e, dtype: object

In [158]:
obj = Series(range(4), index = ['b','z','d', 't'])

In [159]:
obj.sort_index()

b    0
d    2
t    3
z    1
dtype: int64

In [160]:
obj.sort_values()

b    0
z    1
d    2
t    3
dtype: int64

In [161]:
frame

               b         d         e
Utah    0.666073  0.939555  0.439152
Ohio    0.242913  1.488893 -0.624797
Texas   0.277146 -1.396807 -0.311882
Oregon -1.056780 -1.482937  0.309785

In [168]:
frame.sort_values(by = ['d','e'])

               b         d         e
Oregon -1.056780 -1.482937  0.309785
Texas   0.277146 -1.396807 -0.311882
Utah    0.666073  0.939555  0.439152
Ohio    0.242913  1.488893 -0.624797

In [4]:
from pandas import Series, DataFrame

frame = DataFrame({'a': [1,2,3,2,4,3],
                   'b':[2,3,3,4,5,4],
                   'c':[3,3,5,5,6,6]})

In [5]:
frame

   a  b  c
0  1  2  3
1  2  3  3
2  3  3  5
3  2  4  5
4  4  5  6
5  3  4  6

In [6]:
frame.sort_values(by=['a'])

   a  b  c
0  1  2  3
1  2  3  3
3  2  4  5
2  3  3  5
5  3  4  6
4  4  5  6

In [7]:
frame.sort_values(by =['a','b'])

   a  b  c
0  1  2  3
1  2  3  3
3  2  4  5
2  3  3  5
5  3  4  6
4  4  5  6

In [8]:
obj = Series(range(5), index = ['a','a','b','b','c'])

obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [9]:
obj.index.is_unique

False

In [11]:
obj['a']

a    0
a    1
dtype: int64

In [14]:
import numpy as np
df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan, np.nan],[0.75,-1.3]], columns = ['One','Two'])

In [15]:
df

    One  Two
0  1.40  NaN
1  7.10 -4.5
2   NaN  NaN
3  0.75 -1.3

In [17]:
df.sum(axis = 1)

0    1.40
1    2.60
2    0.00
3   -0.55
dtype: float64

In [20]:
df.mean(axis = 1, skipna = False)

0      NaN
1    1.300
2      NaN
3   -0.275
dtype: float64

In [21]:
df.idxmax()

One    1
Two    3
dtype: int64

In [22]:
df.describe()

            One       Two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [23]:
obj = Series(['a','b','c','d']*4)

In [24]:
obj.describe()

count     16
unique     4
top        d
freq       4
dtype: object

In [30]:
import pandas as pd

pd.__version__

'0.24.2'

In [31]:
%%bash
conda install -c anaconda pandas-datareader

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: //anaconda3

  added / updated specs:
    - pandas-datareader


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    ca-certificates-2019.5.15  |                0         133 KB  anaconda
    certifi-2019.6.16          |           py37_0         154 KB  anaconda
    conda-4.7.12               |           py37_0         3.0 MB  anaconda
    openssl-1.1.1c             |       h1de35cc_1         3.4 MB  anaconda
    pandas-datareader-0.8.0    |             py_0          71 KB  anaconda
    ------------------------------------------------------------
                                           Total:         6.8 MB

The following NEW packages will be INSTALLED:

  pandas-datareader  anaconda/noarch::pandas-datareader-0.8.0-py_0

The following packages will be UPDATED:

  conda                      pkgs/main::conda-4.7.10-py37_0 --> anaconda::conda-4.7.12-py37_0

The following packages will be SUPERSEDED by a higher-priority channel:

  ca-certificates                                 pkgs/main --> anaconda
  certifi                                         pkgs/main --> anaconda
  openssl                                         pkgs/main --> anaconda


Proceed ([y]/n)?

Downloading and Extracting Packages
openssl-1.1.1c       | 3.4 MB    | ########## | 100%
ca-certificates-2019 | 133 KB    | ########## | 100%
pandas-datareader-0. | 71 KB     | ########## | 100%
certifi-2019.6.16    | 154 KB    | ########## | 100%
conda-4.7.12         | 3.0 MB    | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

==> WARNING: A newer version of conda exists. <==
  current version: 4.7.10
  latest version: 4.7.12

Please update conda by running

    $ conda update -n base -c defaults conda

In [37]:
import pandas_datareader as pdr

from pandas_datareader import data

In [45]:
#to read some stocks from online
start_date = '2017-01-01'
end_date = '2018-01-01'

all_data = data.DataReader(['GOOG','IBM','MSFT',],'yahoo',start_date,end_date)

In [59]:
all_data.head(10)

Attributes   Adj Close                              Close              \
Symbols           GOOG         IBM       MSFT        GOOG         IBM
Date
2017-01-03  786.140015  148.670532  59.496574  786.140015  167.190002
2017-01-04  786.900024  150.511230  59.230362  786.900024  169.259995
2017-01-05  794.020020  150.013260  59.230362  794.020020  168.699997
2017-01-06  806.150024  150.751312  59.743763  806.150024  169.529999
2017-01-09  806.650024  149.079559  59.553616  806.650024  167.649994
2017-01-10  804.789978  147.185501  59.534603  804.789978  165.520004
2017-01-11  807.909973  149.168472  60.076519  807.909973  167.750000
2017-01-12  806.359985  149.346359  59.525097  806.359985  167.949997
2017-01-13  807.880005  148.803894  59.610664  807.880005  167.339996
2017-01-17  804.609985  149.292984  59.449032  804.609985  167.889999

Attributes                   High                                Low  \
Symbols          MSFT        GOOG         IBM       MSFT        GOOG
Date
2017-01-03  62.580002  789.630005  167.869995  62.840000  775.799988
2017-01-04  62.299999  791.340027  169.869995  62.750000  783.159973
2017-01-05  62.299999  794.479980  169.389999  62.660000  785.020020
2017-01-06  62.840000  807.900024  169.919998  63.150002  792.203979
2017-01-09  62.639999  809.966003  169.800003  63.080002  802.830017
2017-01-10  62.619999  809.130005  168.089996  63.070000  803.510010
2017-01-11  63.189999  808.150024  167.759995  63.230000  801.369995
2017-01-12  62.610001  807.390015  168.009995  63.400002  799.169983
2017-01-13  62.700001  811.223999  168.479996  62.869999  806.690002
2017-01-17  62.529999  807.140015  168.179993  62.700001  800.369995

Attributes                               Open                         \
Symbols            IBM       MSFT        GOOG         IBM       MSFT
Date
2017-01-03  166.009995  62.130001  778.809998  167.000000  62.790001
2017-01-04  167.360001  62.119999  788.359985  167.770004  62.480000
2017-01-05  167.259995  62.029999  786.080017  169.250000  62.189999
2017-01-06  167.520004  62.040001  795.260010  168.690002  62.299999
2017-01-09  167.619995  62.540001  806.400024  169.470001  62.759998
2017-01-10  165.339996  62.279999  807.859985  167.979996  62.730000
2017-01-11  165.600006  62.430000  805.000000  166.050003  62.610001
2017-01-12  165.559998  61.950001  807.140015  167.770004  63.060001
2017-01-13  166.880005  62.349998  807.479980  167.970001  62.619999
2017-01-17  166.119995  62.029999  807.080017  166.690002  62.680000

Attributes     Volume
Symbols          GOOG        IBM        MSFT
Date
2017-01-03  1657300.0  2934300.0  20694100.0
2017-01-04  1073000.0  3381400.0  21340000.0
2017-01-05  1335200.0  2682300.0  24876000.0
2017-01-06  1640200.0  2945500.0  19922900.0
2017-01-09  1274600.0  3189900.0  20382700.0
2017-01-10  1176800.0  4118700.0  18593000.0
2017-01-11  1065900.0  3599500.0  21517300.0
2017-01-12  1353100.0  2927500.0  20968200.0
2017-01-13  1099200.0  2875400.0  19422300.0
2017-01-17  1362100.0  3315700.0  20664000.0

In [57]:
all_data.columns

MultiIndex(levels=[['Adj Close', 'Close', 'High', 'Low', 'Open', 'Volume'], ['GOOG', 'IBM', 'MSFT']],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2, 3, 3, 3, 4, 4, 4, 5, 5, 5], [0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2]],
           names=['Attributes', 'Symbols'])

In [68]:
price = all_data['Adj Close']

In [71]:
volume = all_data['Volume']

In [76]:
returns = price.pct_change()

In [77]:
returns.corr()

Symbols      GOOG       IBM      MSFT
Symbols
GOOG     1.000000  0.064258  0.618149
IBM      0.064258  1.000000  0.062407
MSFT     0.618149  0.062407  1.000000

In [79]:
returns.cov()

Symbols      GOOG       IBM      MSFT
Symbols
GOOG     0.000094  0.000006  0.000056
IBM      0.000006  0.000098  0.000006
MSFT     0.000056  0.000006  0.000087

Symbols
GOOG    0.064258
IBM     1.000000
MSFT    0.062407
dtype: float64

In [81]:
obj = Series(['c','a','a','d','b','c'])

In [88]:
obj[obj.isin(['b','d','z'])]

3    d
4    b
dtype: object

In [90]:
from numpy import nan as NA

In [91]:
data = Series([1,NA, 3.5, NA, 7])

In [93]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [95]:
data = DataFrame([[1,5,6],[1,NA,NA],[NA,NA,NA],[NA,6,-3]], columns=['a','b','c'])

In [96]:
data

     a    b    c
0  1.0  5.0  6.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0 -3.0

In [97]:
data.dropna(how='all')

     a    b    c
0  1.0  5.0  6.0
1  1.0  NaN  NaN
3  NaN  6.0 -3.0

In [98]:
data.dropna(thresh=2)

     a    b    c
0  1.0  5.0  6.0
3  NaN  6.0 -3.0

In [99]:
data.fillna(0)

     a    b    c
0  1.0  5.0  6.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.0 -3.0

In [101]:
data.fillna({'b':1, 'c':-1,})

     a    b    c
0  1.0  5.0  6.0
1  1.0  1.0 -1.0
2  NaN  1.0 -1.0
3  NaN  6.0 -3.0

In [106]:
import numpy as np
data = Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','c','d'],[1,2,3,4,5,6,7,8,9,10]])

In [108]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2, 3], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]])

In [117]:
frame = DataFrame((np.arange(12).reshape(4,3)),index=[['a','a','b','b'],[1,2,1,2]],
                 columns = [['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [133]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [135]:
MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']],names = ['states','color'])

NameError: name 'MultiIndex' is not defined

In [136]:
frame.index.names = ['key1','key2']

frame.columns.names = ['states','color']

In [137]:
frame

states     Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [141]:
frame.swaplevel('states','color',axis = 1)

color     Green  Red    Green
states     Ohio Ohio Colorado
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

In [143]:
frame.sort_index(axis = 1)

states    Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [149]:
frame.set_index(['Green','Red'])

TypeError: set_index() got an unexpected keyword argument 'axis'